config/cf/Catalogs/Метрики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>Метрики</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоИзмерений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Измерения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипИзмерения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подсказка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоУмолчанию</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДополнительноеИзмерениеМетрикиSLA</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязательное</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыНазначенияМетрик</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

config/cf/Enums/СобытиеОбслуживания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>СобытиеОбслуживания</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Добавление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаСклад</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоСклада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Списание</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

config/cf/Enums/СостоянияЭтаповПроцесса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>СостоянияЭтаповПроцесса</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подготовка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бэклог</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подпроцесс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Приостановка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

config/cf/Documents/Доверенность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>Доверенность</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказПоставщику</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаПолучениеОт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоДокументу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.АвторДокумента</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторКорректировки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.АвторДокумента</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКорректировки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Запасы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаименованиеТовара</Name>
							<Comment>Наименование товара</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>Количество</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

config/cf/Documents/ЗакреплениеСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>ЗакреплениеСотрудников</Name>
			<BasedOn>
				<xr:Item>Catalog.МестаХранения</xr:Item>
				<xr:Item>Catalog.Сотрудники</xr:Item>
				<xr:Item>Document.Задание</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ОтветственныеСотрудники</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.АвторДокумента</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторКорректировки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.АвторДокумента</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКорректировки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>МестоХранения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОтветственныйСотрудник</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

config/cf/Catalogs/Метрики/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийЭлементовТаблицаИзмерения

&НаКлиенте
Процедура ИзмеренияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Объект.Измерения.Количество() >= 5 Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Измерений не может быть больше пяти.
                                                          |Если их больше, необходимо пересмотреть логику метрики
														  |и, при необходимости, создать несколько метрик.'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзмеренияПриАктивизацииСтроки(Элемент)
	
	УстановитьТипТекущейСтроки();
	
КонецПроцедуры

&НаКлиенте
Процедура ИзмеренияТипИзмеренияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ВыбранныеОбъектыМетаданных = Новый СписокЗначений;
	ТекДанные = Элементы.Измерения.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		ТипИзмерения 	= ТекДанные.ТипИзмерения;
		МассивТипов 	= СтрРазделить(ТипИзмерения, ";", Ложь);
		Если МассивТипов.Количество() > 0 Тогда
			Для Каждого Эл Из МассивТипов Цикл
				ВыбранныеОбъектыМетаданных.Добавить(Эл);
			КонецЦикла;	
		КонецЕсли;	
	КонецЕсли;	
	
	ФормаПараметры 				= Новый Структура;
	ФильтрПоСсылочнымМетаданным = Новый СписокЗначений;
	ФильтрПоСсылочнымМетаданным.Добавить("Справочники");
	ФильтрПоСсылочнымМетаданным.Добавить("Документы");
	ФильтрПоСсылочнымМетаданным.Добавить("Перечисления");
	ФильтрПоОбъектамМетаданных 	= ФильтрПоОБъектам();
	ФормаПараметры.Вставить("КоллекцииВыбираемыхОбъектовМетаданных", 	ФильтрПоСсылочнымМетаданным);
	ФормаПараметры.Вставить("ВыборЕдинственного", 						Ложь);
	ФормаПараметры.Вставить("ФильтрПоОбъектамМетаданных",				ФильтрПоОбъектамМетаданных);
	ФормаПараметры.Вставить("ОтображатьПримитивныеТипы", 				Истина);
	ФормаПараметры.Вставить("ВыбранныеОбъектыМетаданных",				ВыбранныеОбъектыМетаданных);
	ОткрытьФорму("ОбщаяФорма.ВыборОбъектовМетаданных", ФормаПараметры, Элемент,,,, 
		Новый ОписаниеОповещения("ИзмеренияТипИзмеренияНачалоВыбораЗавершение", ЭтотОбъект), 
		РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Функция ФильтрПоОбъектам()
	
	ФильтрПоОбъектамМетаданных = Новый СписокЗначений;
	ФильтрПоОбъектамМетаданных.Добавить("Справочник.Бюджеты");
	ФильтрПоОбъектамМетаданных.Добавить("Справочник.Валюты");
	ФильтрПоОбъектамМетаданных.Добавить("Справочник.ВидыДенежныхСредств");
	ФильтрПоОбъектамМетаданных.Добавить("Справочник.ВидыДоступаКИнформационнымРесурсам");
	ФильтрПоОбъектамМетаданных.Добавить("Справочник.ВидыКонтактнойИнформации");
	ФильтрПоОбъектамМетаданных.Добавить("Справочник.ВидыМестоположений");
	ФильтрПоОбъектамМетаданных.Добавить("Справочник.ВидыМестХранения");
	ФильтрПоОбъектамМетаданных.Добавить("Справочник.ВидыНоменклатуры");
	ФильтрПоОбъектамМетаданных.Добавить("Справочник.ВидыПоказателейОборудования");
	ФильтрПоОбъектамМетаданных.Добавить("Справочник.ВидыПричинОтклоненияОтГрафика");	
	ФильтрПоОбъектамМетаданных.Добавить("Справочник.ВидыРабот");
	ФильтрПоОбъектамМетаданных.Добавить("Справочник.ГруппыЗаданий");
	ФильтрПоОбъектамМетаданных.Добавить("Справочник.ГруппыКанбанДоски");
	ФильтрПоОбъектамМетаданных.Добавить("Справочник.ГруппыПользователей");
	ФильтрПоОбъектамМетаданных.Добавить("Справочник.ДоговорыКонтрагентов");
	ФильтрПоОбъектамМетаданных.Добавить("Справочник.Должности");
	ФильтрПоОбъектамМетаданных.Добавить("Справочник.ЗначенияХарактеристик");
	ФильтрПоОбъектамМетаданных.Добавить("Справочник.КарточкиНоменклатуры");
	ФильтрПоОбъектамМетаданных.Добавить("Справочник.КатегорииБазыЗнаний");
	ФильтрПоОбъектамМетаданных.Добавить("Справочник.КатегорииЗаданий");
	ФильтрПоОбъектамМетаданных.Добавить("Справочник.Комментарии");
	ФильтрПоОбъектамМетаданных.Добавить("Справочник.Компетенции");
	ФильтрПоОбъектамМетаданных.Добавить("Справочник.КонтактныеЛица");
	ФильтрПоОбъектамМетаданных.Добавить("Справочник.Контрагенты");
	ФильтрПоОбъектамМетаданных.Добавить("Справочник.ЛинииПоддержки");
	ФильтрПоОбъектамМетаданных.Добавить("Справочник.МестаХранения");
	ФильтрПоОбъектамМетаданных.Добавить("Справочник.Местоположения");
	ФильтрПоОбъектамМетаданных.Добавить("Справочник.Метрики");
	ФильтрПоОбъектамМетаданных.Добавить("Справочник.Номенклатура");
	ФильтрПоОбъектамМетаданных.Добавить("Справочник.Организации");
	ФильтрПоОбъектамМетаданных.Добавить("Справочник.ОценкиЗаданий");
	ФильтрПоОбъектамМетаданных.Добавить("Справочник.ПериодыБюджетов");
	ФильтрПоОбъектамМетаданных.Добавить("Справочник.Подразделения");
	ФильтрПоОбъектамМетаданных.Добавить("Справочник.Пользователи");
	ФильтрПоОбъектамМетаданных.Добавить("Справочник.ПотенциальныеКлиенты");
	ФильтрПоОбъектамМетаданных.Добавить("Справочник.ПричиныСписания");
	ФильтрПоОбъектамМетаданных.Добавить("Справочник.Проекты");
	ФильтрПоОбъектамМетаданных.Добавить("Справочник.Производители");
	ФильтрПоОбъектамМетаданных.Добавить("Справочник.Процессы");
	ФильтрПоОбъектамМетаданных.Добавить("Справочник.Решения");
	ФильтрПоОбъектамМетаданных.Добавить("Справочник.РолиКонтактныхЛиц");
	ФильтрПоОбъектамМетаданных.Добавить("Справочник.Сервисы");
	ФильтрПоОбъектамМетаданных.Добавить("Справочник.СостояниеКарточекНоменклатуры");
	ФильтрПоОбъектамМетаданных.Добавить("Справочник.СостояниеНарядовНаРаботы");
	ФильтрПоОбъектамМетаданных.Добавить("Справочник.СостоянияЗаказовПоставщикам");
	ФильтрПоОбъектамМетаданных.Добавить("Справочник.СостоянияОбслуживания");
	ФильтрПоОбъектамМетаданных.Добавить("Справочник.СостоянияСобытий");
	ФильтрПоОбъектамМетаданных.Добавить("Справочник.Сотрудники");
	ФильтрПоОбъектамМетаданных.Добавить("Справочник.СпособыСозданияЗаданий");
	ФильтрПоОбъектамМетаданных.Добавить("Справочник.Спринты");
	ФильтрПоОбъектамМетаданных.Добавить("Справочник.СтатусыКарточекНоменклатуры");
	ФильтрПоОбъектамМетаданных.Добавить("Справочник.СтатьиБазыЗнаний");
	ФильтрПоОбъектамМетаданных.Добавить("Справочник.СтатьиДоходовРасходов");
	ФильтрПоОбъектамМетаданных.Добавить("Справочник.Тарифы");
	ФильтрПоОбъектамМетаданных.Добавить("Справочник.Теги");
	ФильтрПоОбъектамМетаданных.Добавить("Справочник.ТипыПроцессов");
	ФильтрПоОбъектамМетаданных.Добавить("Справочник.УдаленноеУправление");
	ФильтрПоОбъектамМетаданных.Добавить("Справочник.УровниРеакцииИВыполнения");
	ФильтрПоОбъектамМетаданных.Добавить("Справочник.Услуги");
	ФильтрПоОбъектамМетаданных.Добавить("Справочник.ФизическиеЛица");
	ФильтрПоОбъектамМетаданных.Добавить("Справочник.ЭтапыПроцессов");
	ФильтрПоОбъектамМетаданных.Добавить("Справочник.ВидыДел");
	ФильтрПоОбъектамМетаданных.Добавить("Справочник.Дела");
	ФильтрПоОбъектамМетаданных.Добавить("Справочник.Контексты");
	ФильтрПоОбъектамМетаданных.Добавить("Документ.Анкета");
	ФильтрПоОбъектамМетаданных.Добавить("Документ.Встреча");
	ФильтрПоОбъектамМетаданных.Добавить("Документ.Доверенность");
	ФильтрПоОбъектамМетаданных.Добавить("Документ.ЕжедневныйОтчет");
	ФильтрПоОбъектамМетаданных.Добавить("Документ.Задание");
	ФильтрПоОбъектамМетаданных.Добавить("Документ.ЗаказПоставщику");
	ФильтрПоОбъектамМетаданных.Добавить("Документ.ЗакреплениеСотрудников");
	ФильтрПоОбъектамМетаданных.Добавить("Документ.ЗапланированноеВзаимодействие");
	ФильтрПоОбъектамМетаданных.Добавить("Документ.ИзменениеПоказателейОборудования");
	ФильтрПоОбъектамМетаданных.Добавить("Документ.Инвентаризация");
	ФильтрПоОбъектамМетаданных.Добавить("Документ.ЛистУчетаРабочегоВремени");
	ФильтрПоОбъектамМетаданных.Добавить("Документ.НазначениеОпросов");
	ФильтрПоОбъектамМетаданных.Добавить("Документ.НарядНаРаботы");
	ФильтрПоОбъектамМетаданных.Добавить("Документ.НачалоОбслуживания");
	ФильтрПоОбъектамМетаданных.Добавить("Документ.ОкончаниеОбслуживания");
	ФильтрПоОбъектамМетаданных.Добавить("Документ.Перемещение");
	ФильтрПоОбъектамМетаданных.Добавить("Документ.ПеремещениеСотрудников");
	ФильтрПоОбъектамМетаданных.Добавить("Документ.ПланированиеБюджета");
	ФильтрПоОбъектамМетаданных.Добавить("Документ.Поступление");
	ФильтрПоОбъектамМетаданных.Добавить("Документ.ПраваДоступаКИнформационнымРесурсам");
	ФильтрПоОбъектамМетаданных.Добавить("Документ.ПричиныОтклоненияОтГрафика");
	ФильтрПоОбъектамМетаданных.Добавить("Документ.Проблема");
	ФильтрПоОбъектамМетаданных.Добавить("Документ.Продажа");
	ФильтрПоОбъектамМетаданных.Добавить("Документ.РазбиениеКомплектации");
	ФильтрПоОбъектамМетаданных.Добавить("Документ.СборкаКомплектация");
	ФильтрПоОбъектамМетаданных.Добавить("Документ.СнятиеЗакрепленияСотрудников");
	ФильтрПоОбъектамМетаданных.Добавить("Документ.СоглашениеSLA");
	ФильтрПоОбъектамМетаданных.Добавить("Документ.СообщениеSMS");
	ФильтрПоОбъектамМетаданных.Добавить("Документ.Списание");
	ФильтрПоОбъектамМетаданных.Добавить("Документ.ТелефонныйЗвонок");
	ФильтрПоОбъектамМетаданных.Добавить("Документ.УстановкаЦенУслуг");
	ФильтрПоОбъектамМетаданных.Добавить("Документ.УчетДенежныхСредств");
	ФильтрПоОбъектамМетаданных.Добавить("Документ.ЭлектронноеПисьмоВходящее");
	ФильтрПоОбъектамМетаданных.Добавить("Документ.ЭлектронноеПисьмоИсходящее");
	ФильтрПоОбъектамМетаданных.Добавить("Перечисление.ВидКонтрагента");
	ФильтрПоОбъектамМетаданных.Добавить("Перечисление.ВидыДоговоров");
	ФильтрПоОбъектамМетаданных.Добавить("Перечисление.ВидыДоходовРасходов");
	ФильтрПоОбъектамМетаданных.Добавить("Перечисление.ВидыСоглашенийSLA");
	ФильтрПоОбъектамМетаданных.Добавить("Перечисление.Влияние");
	ФильтрПоОбъектамМетаданных.Добавить("Перечисление.ДниНедели");
	ФильтрПоОбъектамМетаданных.Добавить("Перечисление.ПериодичностьМетрик");
	ФильтрПоОбъектамМетаданных.Добавить("Перечисление.ПланФакт");
	ФильтрПоОбъектамМетаданных.Добавить("Перечисление.ПриоритетЗадания");
	ФильтрПоОбъектамМетаданных.Добавить("Перечисление.СобытиеОбслуживания");	
	ФильтрПоОбъектамМетаданных.Добавить("Перечисление.СостоянияЭтаповПроцесса");
	ФильтрПоОбъектамМетаданных.Добавить("Перечисление.Срочность");
	ФильтрПоОбъектамМетаданных.Добавить("Перечисление.СтатусыSLA");
	ФильтрПоОбъектамМетаданных.Добавить("Перечисление.СтатусыЗаказов");
	ФильтрПоОбъектамМетаданных.Добавить("Перечисление.СтатусыПроблемы");
	ФильтрПоОбъектамМетаданных.Добавить("Перечисление.СтатусыРемонтов");
	ФильтрПоОбъектамМетаданных.Добавить("Перечисление.СтатусыСервисов");
	ФильтрПоОбъектамМетаданных.Добавить("Перечисление.СтатусыТарифов");
	ФильтрПоОбъектамМетаданных.Добавить("Перечисление.СтатусыУслуг");
	ФильтрПоОбъектамМетаданных.Добавить("Перечисление.ТипыРешений");
	ФильтрПоОбъектамМетаданных.Добавить("Перечисление.ТипыСервисов");	
	
	Возврат ФильтрПоОбъектамМетаданных;
	
	
КонецФункции	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ИзмеренияТипИзмеренияНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
		
	Если Результат <> Неопределено Тогда
		
		Элементы.Измерения.ТекущиеДанные.ПоУмолчанию	= Неопределено;
		
		ТипИзмерения 	= "";
		Представление 	= "";
		Для Каждого ВыбранныйТип Из Результат Цикл
			ТипИзмерения 	= ТипИзмерения + ВыбранныйТип.Значение + ";";			
			Представление	= Представление + ?(ПустаяСтрока(Представление),"","; ") + ВыбранныйТип.Представление;
		КонецЦикла;
		Элементы.Измерения.ТекущиеДанные.ТипИзмерения	= ТипИзмерения;
		Элементы.Измерения.ТекущиеДанные.Представление	= Представление;	
		УстановитьТипТекущейСтроки();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция СинонимПоПолномуИмениМетаданных(Знач Имя)
	
	Возврат МетрикиВызовСервера.СинонимПоПолномуИмениМетаданных(Имя);
	
КонецФункции

&НаКлиенте
Процедура УстановитьТипТекущейСтроки()
	
	ТекущиеДанные = Элементы.Измерения.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ИзмеренияПоУмолчанию.ОграничениеТипа = 
				МетрикиВызовСервера.ПолучитьОграничениеТипаПоПолномуИмени(ТекущиеДанные.ТипИзмерения);
	
КонецПроцедуры

#КонецОбласти
